# Дана строка. Удалите из этой строки все символы @.
# Формат ввода. Вводится строка.
# Формат вывода. Выведите ответ на задачу.

s = input()

a = s.replace('@', '')
print(a)
